ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
/************************************************************
  Lovebox ESP32-S3 Firmware

  - Connects via WiFiManager captive portal
  - Polls Netlify backend for new images
  - Downloads 320x240 RGB565 binary and renders it on ILI9341
  - Animates SG90 servo on new image
  - Stores last processed image ID in NVS (Preferences)
  - XPT2046 touchscreen: heart like, pen toolbar, drawing feedback

  Required libraries:
    - LovyanGFX
    - XPT2046_Touchscreen
    - WiFiManager
    - ArduinoJson
    - ESP32Servo
************************************************************/

#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <FFat.h>
#include <ESP32Servo.h>
#include <LovyanGFX.hpp>
#include <SPI.h>
#include <XPT2046_Touchscreen.h>
#include <esp_system.h>

// ---------------------------------------------------------------------------
// User configuration
// ---------------------------------------------------------------------------
const char* DEVICE_ID = "lovebox-001";
const char* DEVICE_KEY = "32b65c99d66ee1a4093e214ce55bc786495bb1421140ae268d7f0b3fdbab6730";
const char* API_HOST = "https://effervescent-scone-29511f.netlify.app";
const char* FIRMWARE_VERSION = "1.0.0";

// ---------------- TFT pins ----------------
#undef TFT_CS
#undef TFT_DC
#undef TFT_RST
#undef TFT_MOSI
#undef TFT_MISO
#define TFT_CS    10
#define TFT_DC     9
#define TFT_RST   14
#define TFT_MOSI  11
#define TFT_SCK   12
#define TFT_MISO  13

// ---------------- Touch pins (shared SPI bus, separate CS) ----------------
#define TOUCH_CS   16
#define TOUCH_IRQ  17
#define TOUCH_MOSI 11
#define TOUCH_MISO 13
#define TOUCH_SCK  12

// Calibration for current 320x240 landscape orientation (tft.setRotation(1))
const int RAW_X_MIN = 439;
const int RAW_X_MAX = 3867;
const int RAW_Y_MIN = 360;
const int RAW_Y_MAX = 3795;

// Set true only once when you deliberately want to erase saved Wi-Fi
#define ERASE_SAVED_WIFI false

const int POLL_INTERVAL_MS = 5000;
const int HTTP_TIMEOUT_MS = 20000;
const int DOWNLOAD_TIMEOUT_MS = 30000;
const unsigned long HEALTH_INTERVAL_MS = 15UL * 60UL * 1000UL;

const int SERVO_PIN = 15;
const int SERVO_BASE_ANGLE = 90;
const int SERVO_LEFT_ANGLE = 45;
const int SERVO_RIGHT_ANGLE = 135;
const int SERVO_STEP_DELAY_MS = 20;

const int SCREEN_WIDTH = 320;
const int SCREEN_HEIGHT = 240;
const int IMAGE_SIZE = SCREEN_WIDTH * SCREEN_HEIGHT * 2; // RGB565, 2 bytes per pixel
const char* IMAGE_PATH = "/latest.rgb565";

class LoveboxDisplay : public lgfx::LGFX_Device {
  lgfx::Panel_ILI9341 panel;
  lgfx::Bus_SPI bus;

 public:
  LoveboxDisplay() {
    auto busConfig = bus.config();
    busConfig.spi_host = SPI2_HOST;
    busConfig.spi_mode = 0;
    busConfig.freq_write = 10000000;
    busConfig.freq_read = 16000000;
    busConfig.spi_3wire = false;
    busConfig.use_lock = true;
    busConfig.dma_channel = SPI_DMA_CH_AUTO;
    busConfig.pin_sclk = TFT_SCK;
    busConfig.pin_mosi = TFT_MOSI;
    busConfig.pin_miso = TFT_MISO;
    busConfig.pin_dc = TFT_DC;
    bus.config(busConfig);
    panel.setBus(&bus);

    auto panelConfig = panel.config();
    panelConfig.pin_cs = TFT_CS;
    panelConfig.pin_rst = TFT_RST;
    panelConfig.pin_busy = -1;
    panelConfig.panel_width = 240;
    panelConfig.panel_height = 320;
    panelConfig.offset_x = 0;
    panelConfig.offset_y = 0;
    panelConfig.offset_rotation = 0;
    panelConfig.invert = false;
    panelConfig.rgb_order = false;
    panelConfig.dlen_16bit = false;
    panelConfig.bus_shared = false;
    panel.config(panelConfig);
    setPanel(&panel);
  }
};

#define ILI9341_BLACK TFT_BLACK
#define ILI9341_WHITE TFT_WHITE
#define ILI9341_RED TFT_RED
#define ILI9341_GREEN TFT_GREEN
#define ILI9341_BLUE TFT_BLUE
#define ILI9341_YELLOW TFT_YELLOW
#define ILI9341_PINK 0xFC18

// ---------------------------------------------------------------------------
// Global objects
// ---------------------------------------------------------------------------
LoveboxDisplay tft;
Servo heartServo;
WiFiClientSecure secureClient;
HTTPClient http;
Preferences prefs;
XPT2046_Touchscreen touch(TOUCH_CS, TOUCH_IRQ);

String lastProcessedId;
String lastImageError;
String currentCaption;
bool imageStorageReady = false;
bool displayReady = false;
bool servoReady = false;
unsigned long lastHealthAt = 0;
unsigned long lastSuccessfulCommunicationAt = 0;

struct LatestMessage {
  String id;
  String imageId;
  String caption;
  String senderName;
  bool valid;
};

// ---------------------------------------------------------------------------
// Touch overlay / UI state
// ---------------------------------------------------------------------------
struct Button {
  int x, y, w, h;
};

const Button heartBtn = { 250, 0, 70, 40 };
const Button penBtn = { 0, 200, 60, 40 };

const int TOOLBAR_Y = 195;
const int TOOLBAR_H = 45;
const Button drawBtn = { 5, 200, 75, 35 };
const Button clearBtn = { 85, 200, 75, 35 };
const Button sendBtn = { 165, 200, 75, 35 };
const Button closeBtn = { 245, 200, 70, 35 };

// 1-bit overlay: 320 * 240 / 8 = 9600 bytes
uint8_t overlayBuffer[(SCREEN_WIDTH * SCREEN_HEIGHT) / 8];

bool toolbarVisible = false;
bool drawModeActive = false;

bool touchReady = false;
bool wasTouched = false;
int touchStartX = 0;
int touchStartY = 0;
int touchLastX = 0;
int touchLastY = 0;
bool touchMoved = false;
unsigned long lastPollAt = 0;

String toastText;
unsigned long toastUntil = 0;

// Forward declarations
void displayCaption();
LatestMessage fetchLatestMessage();
bool downloadAndDisplayImage(const String& imageId);
void sendAck();
void animateHeart();
void moveServo(int fromAngle, int toAngle);
void renderScreen();
void handleTap(int x, int y);
bool sendLikeFeedback();
bool sendDrawingFeedback();
bool sendHealthReport();

// ---------------------------------------------------------------------------
// Screen helpers
// ---------------------------------------------------------------------------
void showScreen(
  const String& heading,
  const String& line1 = "",
  const String& line2 = "",
  uint16_t headingColor = ILI9341_RED
) {
  tft.fillScreen(ILI9341_BLACK);

